#+POSTID: 26
#+DATE: [2015-07-15 Wed 14:13]
#+SETUPFILE: /home/matt/src/org-html-themes/setup/theme-readtheorg.setup
#+CATEGORY: emacs

*** Web stuff
I do have "webstuff" factored out as a separate library above, I notice. But I would rather have everything here, so I will lazily put this one little thing here, stolen from 
http://blog.binchen.org/posts/code-completion-for-htmljscss-in-emacs.html 
#+BEGIN_SRC emacs-lisp
(require 'company-web-html)                          ; load company mode html backend
(eval-after-load 'company-etags
  '(progn
     (add-to-list 'company-etags-modes 'js2-mode)
     (add-to-list 'company-etags-modes 'web-mode)))
#+END_SRC

#+RESULTS:
| web-mode | js2-mode | prog-mode | c-mode | objc-mode | c++-mode | java-mode | jde-mode | pascal-mode | perl-mode | python-mode |

*** Double Caps correction.
:PROPERTIES:
:EXPORT_FILE_NAME: double-caps-correction
:END:

Stolen from [[http://emacs.stackexchange.com/questions/13970/fixing-double-capitals-as-i-type/13975#13975][here]] and also Elndless Parentheses
#+BEGIN_SRC emacs-lisp
(defun dcaps-to-scaps ()
  "Convert word in DOuble CApitals to Single Capitals."
  (interactive)
  (and (= ?w (char-syntax (char-before)))
       (save-excursion
         (and (if (called-interactively-p)
                  (skip-syntax-backward "w")
                (= -3 (skip-syntax-backward "w")))
              (let (case-fold-search)
                (looking-at "\\b[[:upper:]]\\{2\\}[[:lower:]]"))
              (capitalize-word 1)))))

(add-hook 'post-self-insert-hook #'dcaps-to-scaps nil 'local)

(define-minor-mode dubcaps-mode
  "Toggle `dubcaps-mode'.  Converts words in DOuble CApitals to
Single Capitals as you type."
  :init-value nil
  :lighter (" DC")
  (if dubcaps-mode
      (add-hook 'post-self-insert-hook #'dcaps-to-scaps nil 'local)
    (remove-hook 'post-self-insert-hook #'dcaps-to-scaps 'local)))

 (add-hook 'text-mode-hook #'dubcaps-mode)
    
#+END_SRC

#+RESULTS:
| dubcaps-mode | turn-on-visual-line-mode | er/add-text-mode-expansions | text-mode-hook-identify |

*** Activating PDF Tools
Begin by installing pdf-tools and org-pdfview from ELPA with ~package-list~packages~ or ~package-install~.  

Then make sure they are activated by adding these lines in your init file:

#+BEGIN_SRC emacs-lisp
    (pdf-tools-install)
    (eval-after-load 'org '(require 'org-pdfview))
  (add-to-list 'org-file-apps '("\\.pdf\\'" . (lambda (file link) (org-pdfview-open link))))
  
#+END_SRC

#+RESULTS:
: ((\.doc\' . /usr/bin/libreoffice %s) (\.docx\' . /usr/bin/libreoffice %s) (\.pdf::\([[:digit:]]+\)\' . org-pdfview-open) (\.pdf\' . org-pdfview-open) (auto-mode . emacs) (\.mm\' . default) (\.x?html?\' . /usr/lib/firefox-developer-edition/firefox %s) (\.pdf\' . default) (\.odt\' . /usr/bin/libreoffice %s))

** Opening attachments directly from org
#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-file-apps '("\\.docx\\'" . "/usr/bin/libreoffice %s"))
  (add-to-list 'org-file-apps '("\\.doc\\'" . "/usr/bin/libreoffice %s"))
  (add-to-list 'org-file-apps '("\\.odt\\'" . "/usr/bin/libreoffice %s"))


#+END_SRC

#+RESULTS:
: ((\.doc\' . /usr/bin/libreoffice %s) (\.docx\' . /usr/bin/libreoffice %s) (\.pdf::\([[:digit:]]+\)\' . org-pdfview-open) (\.pdf\' . org-pdfview-open) (auto-mode . emacs) (\.mm\' . default) (\.x?html?\' . firefox %s) (\.pdf\' . default) (\.odt\' . /usr/bin/libreoffice %s))

